In [7]:
import pandas as pd
import numpy as np

In [40]:
df = pd.read_csv("D:\desktop\eda\FOREST_FIRES_IN_BRAZIL.csv" , encoding='latin-1')
df

      year      state     month  number      date
0     1998       Acre   Janeiro     0.0  1/1/1998
1     1999       Acre   Janeiro     0.0  1/1/1999
2     2000       Acre   Janeiro     0.0  1/1/2000
3     2001       Acre   Janeiro     0.0  1/1/2001
4     2002       Acre   Janeiro     0.0  1/1/2002
...    ...        ...       ...     ...       ...
6449  2012  Tocantins  Dezembro   128.0  1/1/2012
6450  2013  Tocantins  Dezembro    85.0  1/1/2013
6451  2014  Tocantins  Dezembro   223.0  1/1/2014
6452  2015  Tocantins  Dezembro   373.0  1/1/2015
6453  2016  Tocantins  Dezembro   119.0  1/1/2016

[6454 rows x 5 columns]

In [41]:
# 1. Display Top 5 Rows of The Dataset
df.head()

   year state    month  number      date
0  1998  Acre  Janeiro     0.0  1/1/1998
1  1999  Acre  Janeiro     0.0  1/1/1999
2  2000  Acre  Janeiro     0.0  1/1/2000
3  2001  Acre  Janeiro     0.0  1/1/2001
4  2002  Acre  Janeiro     0.0  1/1/2002

In [42]:
# 2. Check Last 5 Rows
df.tail()

      year      state     month  number      date
6449  2012  Tocantins  Dezembro   128.0  1/1/2012
6450  2013  Tocantins  Dezembro    85.0  1/1/2013
6451  2014  Tocantins  Dezembro   223.0  1/1/2014
6452  2015  Tocantins  Dezembro   373.0  1/1/2015
6453  2016  Tocantins  Dezembro   119.0  1/1/2016

In [43]:
# 3. Find Shape of Our Dataset (Number of Rows And Number of Columns)
df.shape

(6454, 5)

In [44]:
# 4. Getting Information About Our Dataset Like Total Number Rows, Total Number of Columns, Datatypes of Each Column And Memory Requirement
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    6454 non-null   int64
 1   state   6454 non-null   object
 2   month   6454 non-null   object
 3   number  6454 non-null   float64
 4   date    6454 non-null   object
dtypes: float64(1), int64(1), object(3)
memory usage: 252.2+ KB

In [53]:
# 5. Check For Duplicate Data and Drop Them
df.duplicated().sum()

32

In [59]:
df.drop_duplicates(inplace = True)

In [60]:
df.duplicated().sum()

0

In [62]:
# 6. Check Null Values In The Dataset
df.isnull().sum().sum()

0

In [64]:
# 7. Get Overall Statistics About The Dataframe
df.describe()

              year       number
count  6422.000000  6422.000000
mean   2007.490969   108.815178
std       5.731806   191.142482
min    1998.000000     0.000000
25%    2003.000000     3.000000
50%    2007.000000    24.497000
75%    2012.000000   114.000000
max    2017.000000   998.000000

In [107]:
# 8. Rename Month Names To English
new_month = {
    'Janeiro' : 'January',
    'Fevereiro' : 'February' ,
    'Março' :'March' ,
    'Abril' : 'April' ,
    'Maio' : 'May' ,
    'Junho' : 'June' ,
    'Julho'  : 'July' ,
    'Agosto' : 'August' ,
    'Setembro' : 'September' ,
    'Outubro' : 'October' ,
    'Novembro' :'November' ,
    'Dezembro' : 'December'}
df.replace(new_month , inplace = True)
df

      year      state     month  number      date
0     1998       Acre   January     0.0  1/1/1998
1     1999       Acre   January     0.0  1/1/1999
2     2000       Acre   January     0.0  1/1/2000
3     2001       Acre   January     0.0  1/1/2001
4     2002       Acre   January     0.0  1/1/2002
...    ...        ...       ...     ...       ...
6449  2012  Tocantins  December   128.0  1/1/2012
6450  2013  Tocantins  December    85.0  1/1/2013
6451  2014  Tocantins  December   223.0  1/1/2014
6452  2015  Tocantins  December   373.0  1/1/2015
6453  2016  Tocantins  December   119.0  1/1/2016

[6422 rows x 5 columns]

In [79]:
# 9. Total Number of Fires Registered
df['number'].sum()

698811.073

In [163]:
# 10. In Which Month Maximum Number of Forest Fires Were Reported?

df.groupby('month')['number'].max().idxmax()

'September'

In [164]:
# 11. In Which Year Maximum Number of Forest Fires Was Reported?

df.groupby('year')['number'].max().idxmax()

2008

In [165]:
# 12. In Which State Maximum Number of Forest Fires Was Reported?

df.groupby('state')['number'].max().idxmax()

'Amazonas'

In [178]:
# 13. Find Total Number of Fires Were Reported In Amazonas
# 1st method
# df[df['state']== 'Amazonas'].sum()

# method 2
amazonas = df[df['state']=='Amazonas']
amazonas['number'].sum()

30650.129

In [136]:
# 14. Display Number of Fires Were Reported In Amazonas (Year-Wise)
ab = df[df['state']== 'Amazonas']
ab.groupby('year')['number'].sum()

year
1998     946.000
1999    1061.000
2000     853.000
2001    1297.000
2002    2852.000
2003    1524.268
2004    2298.207
2005    1657.128
2006     997.640
2007     589.601
2008    2717.000
2009    1320.601
2010    2324.508
2011    1652.538
2012    1110.641
2013     905.217
2014    2385.909
2015    1189.994
2016    2060.972
2017     906.905
Name: number, dtype: float64

In [139]:
# 15. Display Number of Fires Were Reported In Amazonas (Day-Wise)
qw = df[df['state']=='Amazonas']
qw.groupby('date')['number'].sum()

date
1/1/1998     946.000
1/1/1999    1061.000
1/1/2000     853.000
1/1/2001    1297.000
1/1/2002    2852.000
1/1/2003    1524.268
1/1/2004    2298.207
1/1/2005    1657.128
1/1/2006     997.640
1/1/2007     589.601
1/1/2008    2717.000
1/1/2009    1320.601
1/1/2010    2324.508
1/1/2011    1652.538
1/1/2012    1110.641
1/1/2013     905.217
1/1/2014    2385.909
1/1/2015    1189.994
1/1/2016    2060.972
1/1/2017     906.905
Name: number, dtype: float64

In [167]:
# 16. Find Total Number of Fires  Were Reported In 2015 And Visualize Data Based on Each ‘Month’
df_2015 = df[df['year']==2015]
df_2015.groupby('month')['number'].sum()

month
April        2573.000
August       4363.125
December     4088.522
February     2309.000
January      4635.000
July         4364.392
June         3260.552
March        2202.000
May          2384.000
November     4034.518
October      4499.525
September    2494.658
Name: number, dtype: float64

In [172]:
# 17. Find Average Number of Fires Were Reported From Highest to Lowest (State-Wise)
avg_df = df.groupby('state')['number'].mean()

avg_df.sort_values(ascending=False)

state
Sao Paulo           213.896226
Mato Grosso         203.479975
Bahia               187.222703
Piau                158.174674
Goias               157.721841
Minas Gerais        156.800243
Tocantins           141.037176
Amazonas            128.243218
Ceara               127.314071
Paraiba             111.073979
Maranhao            105.142808
Pará                102.561272
Pernambuco          102.502092
Roraima             102.029598
Santa Catarina      101.924067
Amapa                91.345506
Rondonia             84.876272
Acre                 77.255356
Rio                  64.698515
Espirito Santo       27.389121
Alagoas              19.271967
Distrito Federal     14.899582
Sergipe              13.543933
Name: number, dtype: float64

In [176]:
# 18. To Find The State Names Where Fires Were Reported In 'dec' Month
dec = df[df['month']== 'December']
dec.groupby('month')['number'].sum()

month
December    57535.48
Name: number, dtype: float64